Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзятыеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.СредстваНаСкладе</xr:Item>
				<xr:Item>AccumulationRegister.СредстваУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИОЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Заказы/Forms/ФормаЭкспорта/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПапкакСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Каталог = " " ;
	Диалог.Заголовок = "Выберите каталог ";
	
	Если Диалог.Выбрать() Тогда
		ПапкакСохранения = Диалог.Каталог+"\";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьEXCEl(Команда)  
	Если ПапкакСохранения = ""  тогда  
		Возврат;
	КонецЕсли;

	//Для уникальности имени файла добавим к его имени дату и время создания
	ДатаВремя = СтрЗаменить(ТекущаяДата(),":",".");
	ИмяФайла = "Выгрузка_"+ДатаВремя;
	//Добавим выбранный каталог к к именя файла 
	ПолноеИмяФайла = ПапкакСохранения+ИмяФайла+".xls";
	
	//Создадим табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	//Создадим файл эксель: Запишем нашу вновь созданную таблицу в файл 
	ТабДок.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	
	//Заполним таблицу на сервере
	ТабДок = КнопкаСформироватьНаСервере(ТабДок);
	
	//Запишем заполненную таблицу в этот же файл
	ТабДок.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	

КонецПроцедуры   
//&НаСервере
//Процедура ЗаполнитьТаблицуНаСервере(ТабДок)
//		
//	
//КонецПроцедуры
&НаСервере
Функция КнопкаСформироватьНаСервере(ТабДок)
	////Прочитаем наш отчет на сервере, чтобы стали доступны процедуры из модуля объект этого отчета
	//Документ = РеквизитФормыВЗначение("Отчет");
	////Вызовем нашу процедуру заполнения
	//Документ.ЗаполнитьТаблицуНаСервере(ТабДок);
	
	Запрос = Новый Запрос;  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыУслуги.Ссылка КАК Ссылка,
		|	ЗаказыУслуги.НомерСтроки КАК НомерСтроки,
		|	ЗаказыУслуги.Услуга КАК Услуга,
		|	ЗаказыУслуги.Цена КАК Цена
		|ИЗ
		|	Документ.Заказы.Услуги КАК ЗаказыУслуги";
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(РезультатЗапроса);       
	Построитель.Вывести(ТабДок);
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		//ТабДок.Вывести(ОбластьСтрока);
	//КонецЦикла;
	
Возврат ТабДок;	
КонецФункции
